name: "test_performance"


input: "data"
input_shape {
  dim: 1
  dim: 3
  dim: 224
  dim: 448
}


layer {
  name: "slice_pair"
  type: "Slice"
  bottom: "data"
  top: "data_q"
  top: "data_p"
  slice_param {
    axis: 3
    slice_point: 224
  }
}
########### Branch Q ###########################

layer {
  name: "conv1_1"
  type: "Convolution"
  bottom: "data_q"
  top: "conv1_1"
  param{
    name: "conv1_1_w"
    lr_mult: 0
  }
  param{
    name: "conv1_1_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }

}

layer {
  bottom: "conv1_1"
  top: "conv1_1"
  name: "relu1_1"
  type: "ReLU"
}
layer {
  bottom: "conv1_1"
  top: "conv1_2"
  name: "conv1_2"
  type: "Convolution"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }
  param {
    name: "conv1_2_w"
    lr_mult: 0
  }
  param {
    name: "conv1_2_b"
    lr_mult: 0
  }
}
layer {
  bottom: "conv1_2"
  top: "conv1_2"
  name: "relu1_2"
  type: "ReLU"
}
layer {
  bottom: "conv1_2"
  top: "pool1"
  name: "pool1"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "pool1"
  top: "conv2_1"
  name: "conv2_1"
  type: "Convolution"
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
  }
  param {
    name: "conv2_1_w"
    lr_mult: 0
  }
  param {
    name: "conv2_1_b"
    lr_mult: 0
  }
}
layer {
  bottom: "conv2_1"
  top: "conv2_1"
  name: "relu2_1"
  type: "ReLU"
}
layer {
  bottom: "conv2_1"
  top: "conv2_2"
  name: "conv2_2"
  type: "Convolution"
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
  }
  param {
    name: "conv2_2_w"
    lr_mult: 0
  }
  param {
    name: "conv2_2_b"
    lr_mult: 0
  }
}
layer {
  bottom: "conv2_2"
  top: "conv2_2"
  name: "relu2_2"
  type: "ReLU"
}
layer {
  bottom: "conv2_2"
  top: "pool2"
  name: "pool2"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "pool2"
  top: "conv3_1"
  name: "conv3_1"
  type: "Convolution"
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
  param {
    name: "conv3_1_w"
    lr_mult: 0
  }
  param {
    name: "conv3_1_b"
    lr_mult: 0
  }
}
layer {
  bottom: "conv3_1"
  top: "conv3_1"
  name: "relu3_1"
  type: "ReLU"
}
layer {
  bottom: "conv3_1"
  top: "conv3_2"
  name: "conv3_2"
  type: "Convolution"
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
  param {
    name: "conv3_2_w"
    lr_mult: 0
  }
  param {
    name: "conv3_2_b"
    lr_mult: 0
  }
}
layer {
  bottom: "conv3_2"
  top: "conv3_2"
  name: "relu3_2"
  type: "ReLU"
}
layer {
  bottom: "conv3_2"
  top: "conv3_3"
  name: "conv3_3"
  type: "Convolution"
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
  param {
    name: "conv3_3_w"
    lr_mult: 0
  }
  param {
    name: "conv3_3_b"
    lr_mult: 0
  }
}
layer {
  bottom: "conv3_3"
  top: "conv3_3"
  name: "relu3_3"
  type: "ReLU"
}
layer {
  bottom: "conv3_3"
  top: "pool3"
  name: "pool3"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "pool3"
  top: "conv4_1"
  name: "conv4_1"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  param {
    name: "conv4_1_w"
    lr_mult: 0
  }
  param {
    name: "conv4_1_b"
    lr_mult: 0
  }
}
layer {
  bottom: "conv4_1"
  top: "conv4_1"
  name: "relu4_1"
  type: "ReLU"
}
layer {
  bottom: "conv4_1"
  top: "conv4_2"
  name: "conv4_2"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  param {
    name: "conv4_2_w"
    lr_mult: 0
  }
  param {
    name: "conv4_2_b"
    lr_mult: 0
  }
}
layer {
  bottom: "conv4_2"
  top: "conv4_2"
  name: "relu4_2"
  type: "ReLU"
}
layer {
  bottom: "conv4_2"
  top: "conv4_3"
  name: "conv4_3"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  param {
    name: "conv4_3_w"
    lr_mult: 0
  }
  param {
    name: "conv4_3_b"
    lr_mult: 0
  }
}
layer {
  bottom: "conv4_3"
  top: "conv4_3"
  name: "relu4_3"
  type: "ReLU"
}
layer {
  bottom: "conv4_3"
  top: "pool4"
  name: "pool4"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "pool4"
  top: "conv5_1"
  name: "conv5_1"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  param {
    name: "conv5_1_w"
    lr_mult: 1
  }
  param {
    name: "conv5_1_b"
    lr_mult: 1
  }
}
layer {
  bottom: "conv5_1"
  top: "conv5_1"
  name: "relu5_1"
  type: "ReLU"
}
layer {
  bottom: "conv5_1"
  top: "conv5_2"
  name: "conv5_2"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  param {
    name: "conv5_2_w"
    lr_mult: 1
  }
  param {
    name: "conv5_2_b"
    lr_mult: 1
  }
}
layer {
  bottom: "conv5_2"
  top: "conv5_2"
  name: "relu5_2"
  type: "ReLU"
}
layer {
  bottom: "conv5_2"
  top: "conv5_3"
  name: "conv5_3"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  param {
    name: "conv5_3_w"
    lr_mult: 1
  }
  param {
    name: "conv5_3_b"
    lr_mult: 1
  }
}
layer {
  bottom: "conv5_3"
  top: "conv5_3"
  name: "relu5_3"
  type: "ReLU"
}
layer {
  bottom: "conv5_3"
  top: "pool5"
  name: "pool5"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "pool5"
  top: "fc6"
  name: "fc6"
  type: "InnerProduct"
  inner_product_param {
    num_output: 4096
  }
  param {
    name: "fc6_w"
    lr_mult: 0
  }
  param {
    name: "fc6_b"
    lr_mult: 0
  }
}

layer {
  bottom: "fc6"
  top: "fc6"
  name: "relu6"
  type: "ReLU"
}
layer {
  bottom: "fc6"
  top: "fc7"
  name: "fc7"
  type: "InnerProduct"
  inner_product_param {
    num_output: 4096
  }
  param {
    name: "fc7_w"
    lr_mult: 0
  }
  param {
    name: "fc7_b"
    lr_mult: 0
  }
}

########### Branch P ###########################

layer {
  name: "conv1_1_p"
  type: "Convolution"
  bottom: "data_p"
  top: "conv1_1_p"
  param{
    name: "conv1_1_w"
    lr_mult: 0
  }
  param{
    name: "conv1_1_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }

}

layer {
  bottom: "conv1_1_p"
  top: "conv1_1_p"
  name: "relu1_1_p"
  type: "ReLU"
}
layer {
  bottom: "conv1_1_p"
  top: "conv1_2_p"
  name: "conv1_2_p"
  type: "Convolution"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }
  param {
    name: "conv1_2_w"
    lr_mult: 0
  }
  param {
    name: "conv1_2_b"
    lr_mult: 0
  }
}
layer {
  bottom: "conv1_2_p"
  top: "conv1_2_p"
  name: "relu1_2_p"
  type: "ReLU"
}
layer {
  bottom: "conv1_2_p"
  top: "pool1_p"
  name: "pool1_p"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "pool1_p"
  top: "conv2_1_p"
  name: "conv2_1_p"
  type: "Convolution"
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
  }
  param {
    name: "conv2_1_w"
    lr_mult: 0
  }
  param {
    name: "conv2_1_b"
    lr_mult: 0
  }
}
layer {
  bottom: "conv2_1_p"
  top: "conv2_1_p"
  name: "relu2_1_p"
  type: "ReLU"
}
layer {
  bottom: "conv2_1_p"
  top: "conv2_2_p"
  name: "conv2_2_p"
  type: "Convolution"
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
  }
  param {
    name: "conv2_2_w"
    lr_mult: 0
  }
  param {
    name: "conv2_2_b"
    lr_mult: 0
  }
}
layer {
  bottom: "conv2_2_p"
  top: "conv2_2_p"
  name: "relu2_2_p"
  type: "ReLU"
}
layer {
  bottom: "conv2_2_p"
  top: "pool2_p"
  name: "pool2_p"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "pool2_p"
  top: "conv3_1_p"
  name: "conv3_1_p"
  type: "Convolution"
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
  param {
    name: "conv3_1_w"
    lr_mult: 0
  }
  param {
    name: "conv3_1_b"
    lr_mult: 0
  }
}
layer {
  bottom: "conv3_1_p"
  top: "conv3_1_p"
  name: "relu3_1_p"
  type: "ReLU"
}
layer {
  bottom: "conv3_1_p"
  top: "conv3_2_p"
  name: "conv3_2_p"
  type: "Convolution"
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
  param {
    name: "conv3_2_w"
    lr_mult: 0
  }
  param {
    name: "conv3_2_b"
    lr_mult: 0
  }
}
layer {
  bottom: "conv3_2_p"
  top: "conv3_2_p"
  name: "relu3_2_p"
  type: "ReLU"
}
layer {
  bottom: "conv3_2_p"
  top: "conv3_3_p"
  name: "conv3_3_p"
  type: "Convolution"
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
  param {
    name: "conv3_3_w"
    lr_mult: 0
  }
  param {
    name: "conv3_3_b"
    lr_mult: 0
  }
}
layer {
  bottom: "conv3_3_p"
  top: "conv3_3_p"
  name: "relu3_3_p"
  type: "ReLU"
}
layer {
  bottom: "conv3_3_p"
  top: "pool3_p"
  name: "pool3_p"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "pool3_p"
  top: "conv4_1_p"
  name: "conv4_1_p"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  param {
    name: "conv4_1_w"
    lr_mult: 0
  }
  param {
    name: "conv4_1_b"
    lr_mult: 0
  }
}
layer {
  bottom: "conv4_1_p"
  top: "conv4_1_p"
  name: "relu4_1_p"
  type: "ReLU"
}
layer {
  bottom: "conv4_1_p"
  top: "conv4_2_p"
  name: "conv4_2_p"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  param {
    name: "conv4_2_w"
    lr_mult: 0
  }
  param {
    name: "conv4_2_b"
    lr_mult: 0
  }
}
layer {
  bottom: "conv4_2_p"
  top: "conv4_2_p"
  name: "relu4_2_p"
  type: "ReLU"
}
layer {
  bottom: "conv4_2_p"
  top: "conv4_3_p"
  name: "conv4_3_p"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  param {
    name: "conv4_3_w"
    lr_mult: 0
  }
  param {
    name: "conv4_3_b"
    lr_mult: 0
  }
}
layer {
  bottom: "conv4_3_p"
  top: "conv4_3_p"
  name: "relu4_3_p"
  type: "ReLU"
}
layer {
  bottom: "conv4_3_p"
  top: "pool4_p"
  name: "pool4_p"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "pool4_p"
  top: "conv5_1_p"
  name: "conv5_1_p"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  param {
    name: "conv5_1_w"
    lr_mult: 1
  }
  param {
    name: "conv5_1_b"
    lr_mult: 1
  }
}
layer {
  bottom: "conv5_1_p"
  top: "conv5_1_p"
  name: "relu5_1_p"
  type: "ReLU"
}
layer {
  bottom: "conv5_1_p"
  top: "conv5_2_p"
  name: "conv5_2_p"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  param {
    name: "conv5_2_w"
    lr_mult: 1
  }
  param {
    name: "conv5_2_b"
    lr_mult: 1
  }
}
layer {
  bottom: "conv5_2_p"
  top: "conv5_2_p"
  name: "relu5_2_p"
  type: "ReLU"
}
layer {
  bottom: "conv5_2_p"
  top: "conv5_3_p"
  name: "conv5_3_p"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  param {
    name: "conv5_3_w"
    lr_mult: 1
  }
  param {
    name: "conv5_3_b"
    lr_mult: 1
  }
}
layer {
  bottom: "conv5_3_p"
  top: "conv5_3_p"
  name: "relu5_3_p"
  type: "ReLU"
}
layer {
  bottom: "conv5_3_p"
  top: "pool5_p"
  name: "pool5_p"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "pool5_p"
  top: "fc6_p"
  name: "fc6_p"
  type: "InnerProduct"
  inner_product_param {
    num_output: 4096
  }
  param {
    name: "fc6_w"
    lr_mult: 0
  }
  param {
    name: "fc6_b"
    lr_mult: 0
  }
}
layer {
  bottom: "fc6_p"
  top: "fc6_p"
  name: "relu6_p"
  type: "ReLU"
}
layer {
  bottom: "fc6_p"
  top: "fc7_p"
  name: "fc7_p"
  type: "InnerProduct"
  inner_product_param {
    num_output: 4096
  }
  param {
    name: "fc7_w"
    lr_mult: 0
  }
  param {
    name: "fc7_b"
    lr_mult: 0
  }
}



#################### Output ############################

layer {
  name: "loss"
  type: "EuclideanLoss"
  bottom: "fc6"
  bottom: "fc6_p"
  top: "loss"
}


